- Title: Replace Values in a pandas DataFrame
- Slug: python-pandas-replace
- Date: 2020-04-13
- Category: Computer Science
- Tags: programming, Python, pandas, DataFrame, replace
- Author: Ben Du
- Modified: 2020-04-13

## Comments 

1. `DataFrame.replace` works different from `DataFrame.update`.

In [2]:
import pandas as pd

In [8]:
df = pd.DataFrame({'x': [1, 2, 3, 4, 5], 'y': [5, 4, 3, 2, 1]})
df

   x  y
0  1  5
1  2  4
2  3  3
3  4  2
4  5  1

In [11]:
df.x[df.x < 3] = 1000

In [12]:
df

      x  y
0  1000  5
1  1000  4
2     3  3
3     4  2
4     5  1

In [6]:
df.y.replace(5, 5000, inplace=True)

In [7]:
df

   x     y
0  1  5000
1  2     4
2  3     3
3  4     2
4  5     1